balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ256GP510.PIC
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="SDO1"/>
      <edc:VirtualPin edc:name="RF8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="SDI1"/>
      <edc:VirtualPin edc:name="RF7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="RF6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RG3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RG2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="RA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="RA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="TDI"/>
      <edc:VirtualPin edc:name="RA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="TDO"/>
      <edc:VirtualPin edc:name="RA5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKIN"/>
      <edc:VirtualPin edc:name="RC12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="RC15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 65-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 66-->
      <edc:VirtualPin edc:name="INT3"/>
      <edc:VirtualPin edc:name="RA14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 67-->
      <edc:VirtualPin edc:name="INT4"/>
      <edc:VirtualPin edc:name="RA15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 68-->
      <edc:VirtualPin edc:name="IC1"/>
      <edc:VirtualPin edc:name="RD8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 69-->
      <edc:VirtualPin edc:name="IC2"/>
      <edc:VirtualPin edc:name="RD9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 70-->
      <edc:VirtualPin edc:name="IC3"/>
      <edc:VirtualPin edc:name="RD10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 71-->
      <edc:VirtualPin edc:name="IC4"/>
      <edc:VirtualPin edc:name="RD11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 72-->
      <edc:VirtualPin edc:name="OC1"/>
      <edc:VirtualPin edc:name="RD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 73-->
      <edc:VirtualPin edc:name="PGED2"/>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="RC13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 74-->
      <edc:VirtualPin edc:name="PGEC2"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="CN0"/>
      <edc:VirtualPin edc:name="RC14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 75-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 76-->
      <edc:VirtualPin edc:name="OC2"/>
      <edc:VirtualPin edc:name="RD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 77-->
      <edc:VirtualPin edc:name="OC3"/>
      <edc:VirtualPin edc:name="RD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 78-->
      <edc:VirtualPin edc:name="OC4"/>
      <edc:VirtualPin edc:name="RD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 79-->
      <edc:VirtualPin edc:name="IC5"/>
      <edc:VirtualPin edc:name="RD12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 80-->
      <edc:VirtualPin edc:name="IC6"/>
      <edc:VirtualPin edc:name="CN19"/>
      <edc:VirtualPin edc:name="RD13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 81-->
      <edc:VirtualPin edc:name="OC5"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="RD4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 82-->
      <edc:VirtualPin edc:name="OC6"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="RD5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 83-->
      <edc:VirtualPin edc:name="OC7"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="RD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 84-->
      <edc:VirtualPin edc:name="OC8"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="RD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 85-->
      <edc:VirtualPin edc:name="Vcap"/>
      <edc:VirtualPin edc:name="Vddcore"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 86-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 87-->
      <edc:VirtualPin edc:name="C1RX"/>
      <edc:VirtualPin edc:name="RF0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 88-->
      <edc:VirtualPin edc:name="C1TX"/>
      <edc:VirtualPin edc:name="RF1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 89-->
      <edc:VirtualPin edc:name="RG1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 90-->
      <edc:VirtualPin edc:name="RG0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 91-->
      <edc:VirtualPin edc:name="AN22"/>
      <edc:VirtualPin edc:name="CN22"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 92-->
      <edc:VirtualPin edc:name="AN23"/>
      <edc:VirtualPin edc:name="CN23"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 93-->
      <edc:VirtualPin edc:name="AN24"/>
      <edc:VirtualPin edc:name="RE0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 94-->
      <edc:VirtualPin edc:name="AN25"/>
      <edc:VirtualPin edc:name="RE1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 95-->
      <edc:VirtualPin edc:name="CSCK"/>
      <edc:VirtualPin edc:name="RG14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 96-->
      <edc:VirtualPin edc:name="CSDI"/>
      <edc:VirtualPin edc:name="RG12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 97-->
      <edc:VirtualPin edc:name="CSDO"/>
      <edc:VirtualPin edc:name="RG13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 98-->
      <edc:VirtualPin edc:name="AN26"/>
      <edc:VirtualPin edc:name="RE2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 99-->
      <edc:VirtualPin edc:name="AN27"/>
      <edc:VirtualPin edc:name="RE3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 100-->
      <edc:VirtualPin edc:name="AN28"/>
      <edc:VirtualPin edc:name="RE4"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>